



data class Book(val name: String, val titles: Array<String>) {

}

var padhigam1 = arrayOf("பதிகங்கள்","1 திருப்பிரமபுரம்", "2 திருப்புகலூர்", "3 திருவலிதாயம்",
    "4 திருப்புகலியும் திருவீழிமிழலையும்", "5 கீழைத்திருக்காட்டுப்பள்ளி", "6 திருமருகலும் திருச்செங்காட்டங்குடியும்", "7 திருநள்ளாறும் திருவாலவாயும்",
     "8 திருஆவூர்ப்பசுபதீச்சரம்", "9 திருவேணுபுரம்", "10 திருவண்ணாமலை", "11 திருவீழிமிழலை", "12 திருமுதுகுன்றம்", "13 திருவியலூர்", "14 திருக்கொடுங்குன்றம்",
    "15 திருநெய்த்தானம்", "16 திருப்புள்ளமங்கை", "17 திருஇடும்பாவனம்", "18 திருநின்றியூர்", "19 திருக்கழுமலம்", "20 திருவீழிமிழலை",
    "21 திருச்சிவபுரம்", "22 திருமறைக்காடு", "23 திருக்கோலக்கா", "24 சீகாழி", "25 திருச்செம்பொன்பள்ளி", "26 திருப்புத்தூர்", "27 திருப்புன்கூர்",
    "28 திருச்சோற்றுத்துறை", "29 திருநறையூர்ச்சித்தீச்சரம்", "30 திருப்புகலி", "31 திருக்குரங்கணின்முட்டம்", "32 திருவிடைமருதூர்", "33 திருஅன்பிலாலந்துறை",
    "34 சீகாழி", "35 திருவீழிமிழலை", "36 திருவையாறு", "37 திருப்பனையூர்", "38 திருமயிலாடுதுறை", "39 திருவேட்களம்", "40 திருவாழ்கொளிபுத்தூர்",
    "41 திருப்பாம்புரம்", "42 திருப்பேணுபெருந்துறை", "43 திருக்கற்குடி", "44 திருப்பாச்சிலாச்சிராமம்", "45 திருவாலங்காடு", "46 திருவதிகைவீரட்டானம்", "47 திருச்சிரபுரம்",
    "48 திருச்சேய்ஞலூர்", "49 திருநள்ளாறு", "50 திருவலிவலம்", "51 திருச்சோபுரம்", "52 ", "53 ", "54 ", "55 ", "56 ", "57 ", "58 ", "59 ", "60 ", "61 ", "62 ", "63 ", "64 ", "65 ", "66 ", "67 ", "68 ", "69 ", "70 ", "71 ", "72 ", "73 ", "74 ", "75 ", "76 ", "77 ", "78 ", "79 ", "80 ", "81 ", "82 ", "83 ", "84 ", "85 ", "86 ", "87 ", "88 ", "89 ", "90 ", "91 ", "92 ", "93 ", "94 ", "95 ", "96 ", "97 ", "98 ", "99 ", "100 ", "101 ", "102 ", "103 ", "104 ", "105 ", "106 ", "107 ", "108 ", "109 ", "110 ")


var padhigam2 = arrayOf("பதிகங்கள்", "1 ", "2 ", "3 ", "4 ", "5 ", "6 ", "7 ", "8 ", "9 ", "10 ", "11 ", "12 ", "13 ", "14 ", "15 ", "16 ", "17 ", "18 ", "19 ", "20 ", "21 ", "22 ", "23 ", "24 ", "25 ", "26 ", "27 ", "28 ", "29 ", "30 ", "31 ", "32 ", "33 ", "34 ", "35 ", "36 ", "37 ", "38 ", "39 ", "40 ", "41 ", "42 ", "43 ", "44 ", "45 ", "46 ", "47 ", "48 ", "49 ", "50 ", "51 ", "52 ", "53 ", "54 ", "55 ", "56 ", "57 ", "58 ", "59 ", "60 ", "61 ", "62 ", "63 ", "64 ", "65 ", "66 ", "67 ", "68 ", "69 ", "70 ", "71 ", "72 ", "73 ", "74 ", "75 ", "76 ", "77 ", "78 ", "79 ", "80 ", "81 ", "82 ", "83 ", "84 ", "85 ", "86 ", "87 ", "88 ", "89 ", "90 ", "91 ", "92 ", "93 ", "94 ", "95 ", "96 ", "97 ", "98 ", "99 ", "100 ", "101 ", "102 ", "103 ", "104 ", "105 ", "106 ", "107 ", "108 ", "109 ", "110 ")
var padhigam3 = arrayOf("பதிகங்கள்", "1 ", "2 ", "3 ", "4 ", "5 ", "6 ", "7 ", "8 ", "9 ", "10 ", "11 ", "12 ", "13 ", "14 ", "15 ", "16 ", "17 ", "18 ", "19 ", "20 ", "21 ", "22 ", "23 ", "24 ", "25 ", "26 ", "27 ", "28 ", "29 ", "30 ", "31 ", "32 ", "33 ", "34 ", "35 ", "36 ", "37 ", "38 ", "39 ", "40 ", "41 ", "42 ", "43 ", "44 ", "45 ", "46 ", "47 ", "48 ", "49 ", "50 ", "51 ", "52 ", "53 ", "54 ", "55 ", "56 ", "57 ", "58 ", "59 ", "60 ", "61 ", "62 ", "63 ", "64 ", "65 ", "66 ", "67 ", "68 ", "69 ", "70 ", "71 ", "72 ", "73 ", "74 ", "75 ", "76 ", "77 ", "78 ", "79 ", "80 ", "81 ", "82 ", "83 ", "84 ", "85 ", "86 ", "87 ", "88 ", "89 ", "90 ", "91 ", "92 ", "93 ", "94 ", "95 ", "96 ", "97 ", "98 ", "99 ", "100 ", "101 ", "102 ", "103 ", "104 ", "105 ", "106 ", "107 ", "108 ", "109 ", "110 ")
var padhigam4 = arrayOf("பதிகங்கள்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்")
var padhigam5 = arrayOf("பதிகங்கள்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்")
var padhigam6 = arrayOf("பதிகங்கள்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்")
var padhigam7 = arrayOf("பதிகங்கள்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்")
var padhigam8 = arrayOf("பதிகங்கள்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்","பிரமபுரம்")


val book1 = Book("திருஞானசம்பந்தர் தேவாரம் 1",padhigam1)
val book2 = Book("திருஞானசம்பந்தர் தேவாரம் 2",padhigam2)
val book3 = Book("திருஞானசம்பந்தர் தேவாரம் 3",padhigam3)
val book4 = Book("திருநாவுக்கரசர் தேவாரம் 1",padhigam4)
val book5 = Book("திருநாவுக்கரசர் தேவாரம் 2",padhigam5)
val book6 = Book("திருநாவுக்கரசர் தேவாரம் 3",padhigam6)
val book7 = Book("சுந்தரர் தேவாரம்",padhigam7)
val book8 = Book("மாணிக்கவாசகர் திருவாசகம்",padhigam8)


var bookList = arrayOf(book1,book2,book3,book4,book5,book6,book7,book8)
